package com.cc.bootstrap.intl.demo.lambda.stream_api;

/**
 * @Description: 流简介
 * @author: ChenChen
 * @date: 2023/1/28 10:34
 */
public class Study1_Info {
//    流到底是什么呢？简短的定义就是“从支持数据处理操作的源生成的元素序列”。
//    1.元素序列——集合讲的是数据，流讲的是计算。
//    2.源——流会使用一个提供数据的源，如集合、数组或输入/输出资源。 请注意，从有序集合生成流时会保留原有的顺序。由列表生成的流，其元素顺序与列表一致。
//    3.数据处理操作——流的数据处理功能支持类似于数据库的操作，以及函数式编程语言中
//                  的常用操作，如filter、map、reduce、find、match、sort等。流操作可以顺序执
//                  行，也可并行执行。
//
//    流操作有两个重要的特点。
//    1.流水线——很多流操作本身会返回一个流，这样多个操作就可以链接起来，形成一个大的流水线。
//    这让我们下一章中的一些优化成为可能，如延迟和短路。流水线的操作可以看作对数据源进行数据库式查询。
//    2.内部迭代——与使用迭代器显式迭代的集合不同，流的迭代操作是在背后进行的。
}
